export type tGroup = {
    "id": number,
    "Группа": string | number,
    "Минимальная стоимость активов": number,
    "Максимальная стоимость активов": number,
    "Средняя стоимость активов": number,
}[];


export const years: tGroup = [
    {
        id: 1,
        'Группа': '31',
        'Минимальная стоимость активов': 39.6,
        'Максимальная стоимость активов': 39.6,
        'Средняя стоимость активов': 39.6
    },
    {
        id: 2,
        'Группа': '39',
        'Минимальная стоимость активов': 177,
        'Максимальная стоимость активов': 177,
        'Средняя стоимость активов': 177
    },
    {
        id: 3,
        'Группа': '40',
        'Минимальная стоимость активов': 43.4,
        'Максимальная стоимость активов': 43.4,
        'Средняя стоимость активов': 43.4
    },
    {
        id: 4,
        'Группа': '44',
        'Минимальная стоимость активов': 38.9,
        'Максимальная стоимость активов': 38.9,
        'Средняя стоимость активов': 38.9
    },
    {
        id: 5,
        'Группа': '47',
        'Минимальная стоимость активов': 33,
        'Максимальная стоимость активов': 33,
        'Средняя стоимость активов': 33
    },
    {
        id: 6,
        'Группа': '50',
        'Минимальная стоимость активов': 110,
        'Максимальная стоимость активов': 110,
        'Средняя стоимость активов': 110
    },
    {
        id: 7,
        'Группа': '51',
        'Минимальная стоимость активов': 114,
        'Максимальная стоимость активов': 114,
        'Средняя стоимость активов': 114
    },
    {
        id: 8,
        'Группа': '52',
        'Минимальная стоимость активов': 33.5,
        'Максимальная стоимость активов': 195,
        'Средняя стоимость активов': 114.25
    },
    {
        id: 9,
        'Группа': '53',
        'Минимальная стоимость активов': 35.6,
        'Максимальная стоимость активов': 35.6,
        'Средняя стоимость активов': 35.6
    },
    {
        id: 10,
        'Группа': '55',
        'Минимальная стоимость активов': 36.4,
        'Максимальная стоимость активов': 36.4,
        'Средняя стоимость активов': 36.4
    },
    {
        id: 11,
        'Группа': '59',
        'Минимальная стоимость активов': 43.8,
        'Максимальная стоимость активов': 91,
        'Средняя стоимость активов': 67.4
    },
    {
        id: 12,
        'Группа': '60',
        'Минимальная стоимость активов': 194,
        'Максимальная стоимость активов': 194,
        'Средняя стоимость активов': 194
    },
    {
        id: 13,
        'Группа': '61',
        'Минимальная стоимость активов': 64.3,
        'Максимальная стоимость активов': 84,
        'Средняя стоимость активов': 75.1
    },
    {
        id: 14,
        'Группа': '66',
        'Минимальная стоимость активов': 67.8,
        'Максимальная стоимость активов': 116,
        'Средняя стоимость активов': 91.9
    },
    {
        id: 15,
        'Группа': '68',
        'Минимальная стоимость активов': 121,
        'Максимальная стоимость активов': 128,
        'Средняя стоимость активов': 124.5
    },
    {
        id: 16,
        'Группа': '69',
        'Минимальная стоимость активов': 62.3,
        'Максимальная стоимость активов': 62.3,
        'Средняя стоимость активов': 62.3
    },
    {
        id: 17,
        'Группа': '70',
        'Минимальная стоимость активов': 99.5,
        'Максимальная стоимость активов': 99.5,
        'Средняя стоимость активов': 99.5
    },
    {
        id: 18,
        'Группа': '73',
        'Минимальная стоимость активов': 36.8,
        'Максимальная стоимость активов': 36.8,
        'Средняя стоимость активов': 36.8
    },
    {
        id: 19,
        'Группа': '74',
        'Минимальная стоимость активов': 33.5,
        'Максимальная стоимость активов': 72.3,
        'Средняя стоимость активов': 52.9
    },
    {
        id: 20,
        'Группа': '75',
        'Минимальная стоимость активов': 36.8,
        'Максимальная стоимость активов': 233,
        'Средняя стоимость активов': 97.75
    },
    {
        id: 21,
        'Группа': '77',
        'Минимальная стоимость активов': 38.8,
        'Максимальная стоимость активов': 38.8,
        'Средняя стоимость активов': 38.8
    },
    {
        id: 22,
        'Группа': '78',
        'Минимальная стоимость активов': 36.9,
        'Максимальная стоимость активов': 36.9,
        'Средняя стоимость активов': 36.9
    },
    {
        id: 23,
        'Группа': '79',
        'Минимальная стоимость активов': 33.1,
        'Максимальная стоимость активов': 141,
        'Средняя стоимость активов': 87
    },
    {
        id: 24,
        'Группа': '82',
        'Минимальная стоимость активов': 106,
        'Максимальная стоимость активов': 106,
        'Средняя стоимость активов': 106
    },
    {
        id: 25,
        'Группа': '83',
        'Минимальная стоимость активов': 33.1,
        'Максимальная стоимость активов': 33.1,
        'Средняя стоимость активов': 33.1
    },
    {
        id: 26,
        'Группа': '84',
        'Минимальная стоимость активов': 38,
        'Максимальная стоимость активов': 102,
        'Средняя стоимость активов': 59.5
    },
    {
        id: 27,
        'Группа': '86',
        'Минимальная стоимость активов': 39.2,
        'Максимальная стоимость активов': 40.9,
        'Средняя стоимость активов': 40.05
    },
    {
        id: 28,
        'Группа': '88',
        'Минимальная стоимость активов': 33.6,
        'Максимальная стоимость активов': 103,
        'Средняя стоимость активов': 58.4
    },
    {
        id: 29,
        'Группа': '93',
        'Минимальная стоимость активов': 133,
        'Максимальная стоимость активов': 133,
        'Средняя стоимость активов': 133
    },
    {
        id: 30,
        'Группа': '95',
        'Минимальная стоимость активов': 37.3,
        'Максимальная стоимость активов': 37.3,
        'Средняя стоимость активов': 37.3
    }
]
export const industries: tGroup =
    [
        {
            id: 1,
            'Группа': 'Fashion & Retail',
            'Минимальная стоимость активов': 36.8,
            'Максимальная стоимость активов': 233,
            'Средняя стоимость активов': 134.9
        },
        {
            id: 2,
            'Группа': 'Automotive',
            'Минимальная стоимость активов': 195,
            'Максимальная стоимость активов': 195,
            'Средняя стоимость активов': 195
        },
        {
            id: 3,
            'Группа': 'Technology',
            'Минимальная стоимость активов': 33.5,
            'Максимальная стоимость активов': 194,
            'Средняя стоимость активов': 95.81
        },
        {
            id: 4,
            'Группа': 'Finance & Investments',
            'Минимальная стоимость активов': 33,
            'Максимальная стоимость активов': 133,
            'Средняя стоимость активов': 63.53
        },
        {
            id: 5,
            'Группа': 'Diversified',
            'Минимальная стоимость активов': 37.3,
            'Максимальная стоимость активов': 116,
            'Средняя стоимость активов': 67.25
        },
        {
            id: 6,
            'Группа': 'Telecom',
            'Минимальная стоимость активов': 102,
            'Максимальная стоимость активов': 102,
            'Средняя стоимость активов': 102
        },
        {
            id: 7,
            'Группа': 'Media & Entertainment',
            'Минимальная стоимость активов': 67.8,
            'Максимальная стоимость активов': 67.8,
            'Средняя стоимость активов': 67.8
        },
        {
            id: 8,
            'Группа': 'Food & Beverage',
            'Минимальная стоимость активов': 38.5,
            'Максимальная стоимость активов': 62.3,
            'Средняя стоимость активов': 44.54
        },
        {
            id: 9,
            'Группа': 'Logistics',
            'Минимальная стоимость активов': 33.1,
            'Максимальная стоимость активов': 39.2,
            'Средняя стоимость активов': 35.13
        },
        {
            id: 10,
            'Группа': 'Manufacturing',
            'Минимальная стоимость активов': 33.6,
            'Максимальная стоимость активов': 33.6,
            'Средняя стоимость активов': 33.6
        },
        {
            id: 11,
            'Группа': 'Metals & Mining',
            'Минимальная стоимость активов': 33.5,
            'Максимальная стоимость активов': 33.5,
            'Средняя стоимость активов': 33.5
        }
    ]
export const countries: tGroup = [
    {
        id: 1,
        "Группа": "France", "Минимальная стоимость активов": 36.8, "Максимальная стоимость активов": 233, "Средняя стоимость активов": 101.53
    },
    {
        id: 2,
        "Группа": "United States",
        "Минимальная стоимость активов": 34,
        "Максимальная стоимость активов": 195,
        "Средняя стоимость активов": 114
    },
    {
        id: 3,
        "Группа": "India",
        "Минимальная стоимость активов": 33.5,
        "Максимальная стоимость активов": 116,
        "Средняя стоимость активов": 67.6
    },
    {
        id: 4,
        "Группа": "Spain",
        "Минимальная стоимость активов": 103,
        "Максимальная стоимость активов": 103,
        "Средняя стоимость активов": 103
    },
    {
        id: 5,
        "Группа": "Mexico",
        "Минимальная стоимость активов": 102,
        "Максимальная стоимость активов": 102,
        "Средняя стоимость активов": 102
    },
    {
        id: 6,
        "Группа": "Canada",
        "Минимальная стоимость активов": 33,
        "Максимальная стоимость активов": 67.8,
        "Средняя стоимость активов": 50.4
    },
    {
        id: 7,
        "Группа": "China",
        "Минимальная стоимость активов": 33.5,
        "Максимальная стоимость активов": 62.3,
        "Средняя стоимость активов": 44.52
    },
    {
        id: 8,
        "Группа": "Italy",
        "Минимальная стоимость активов": 43.8,
        "Максимальная стоимость активов": 43.8,
        "Средняя стоимость активов": 43.8
    },
    {
        id: 9,
        "Группа": "Indonesia",
        "Минимальная стоимость активов": 43.4,
        "Максимальная стоимость активов": 43.4,
        "Средняя стоимость активов": 43.4
    },
    {
        id: 10,
        "Группа": "Japan",
        "Минимальная стоимость активов": 42.8,
        "Максимальная стоимость активов": 42.8,
        "Средняя стоимость активов": 42.8
    },
    {
        id: 11,
        "Группа": "Austria",
        "Минимальная стоимость активов": 39.6,
        "Максимальная стоимость активов": 39.6,
        "Средняя стоимость активов": 39.6
    },
    {
        id: 12,
        "Группа": "Germany",
        "Минимальная стоимость активов": 33.6,
        "Максимальная стоимость активов": 39.2,
        "Средняя стоимость активов": 36.93
    },
    {
        id: 13,
        "Группа": "Hong Kong",
        "Минимальная стоимость активов": 37.3,
        "Максимальная стоимость активов": 37.3,
        "Средняя стоимость активов": 37.3
    },
    {
        id: 14,
        "Группа": "Switzerland",
        "Минимальная стоимость активов": 33.1,
        "Максимальная стоимость активов": 33.1,
        "Средняя стоимость активов": 33.1
    }
]